Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.OutlineColor
Color of outline and fence lines in the diagram.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.TextTypeId
Element id of text associated with the settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Since:
2012

Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings.#ctor(Autodesk.Revit.DB.Analysis.AnalysisDisplayDiagramSettings)
Constructs a new copy of the input AnalysisDisplayDiagramSettings object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2012